test-doc-credentials.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <searchHotelFares xmlns="http://tempuri.org/">
      <searchHotelFaresRQ1>
        <cityLocation code="BUE"/>
        <dateFrom>2010-09-27</dateFrom>
        <dateTo>2010-09-30</dateTo>
        <name>HOTEL MELIA</name>
        <pos>
          <id>TESTEO</id>
          <clave>testeows</clave>
        </pos>
        <currency>USD</currency>
      </searchHotelFaresRQ1>
    </searchHotelFares>
  </soap:Body>
</soap:Envelope>